#Import
from prettytable import PrettyTable
import csv
import matplotlib.pyplot as plt
from prettytable import PrettyTable



#Інформація таблиці
biba = [
    ["1 англійський фунт стерлінг", "103","2003", 565.46, 604.57, 1.07, 1003.17, 1.66, 1.77,1], 
    ["1 англійський фунт стерлінг", "103","2004", 110.25, 1120.60, 10.16, 1350.40, 1.21, 12.25,1], 
    ["1 англійський фунт стерлінг", "103","2005", 1364.20, 1370.10, 1.00, 1380.15, 1.01, 1.01,1],
    ["10 бельгійських франків", "104","2003", 113.03, 122.60, 1.08, 200.38, 1.63, 1.77,1],
    ["10 бельгійських франків", "104","2004", 250.45, 260.45, 1.04, 275.20, 1.06, 1.10,1], 
    ["10 бельгійських франків", "104","2005", 280.10, 283.40, 1.01, 285.10, 1.01, 1.02,1],
    ["1 німецька марка", "105","2003", 227.91, 252.07, 1.11, 412.02, 1.63, 1.81,1],
    ["1 німецька марка", "105","2004", 444.23, 465.40, 1.05, 470.20, 1.01, 1.06,1],
    ["1 німецька марка", "105","2005", 475.23, 480.30, 1.01, 485.20, 1.01, 1.02,1],
    ["1 голандський гульден", "106","2003", 202.42, 224.00, 1.11, 366.26, 1.64, 1.81,1],
    ["1 голандський гульден", "106","2004", 405.05, 425.35, 1.05, 450.30, 1.06, 1.11,1],
    ["1 голандський гульден", "106","2004", 462.20, 464.10, 1.00, 466.15, 1.00, 1.01,1],
    ["1 канадський долар", "109","2003", 267.88, 318.00, 1.19, 511.92, 1.61, 1.91,1], 
    ["1 канадський долар", "109","2004", 605.20, 630.15, 1.04, 680.25, 1.08, 1.12,1],
    ["1 канадський долар", "109","2005", 690.10, 695.15, 1.01, 699.80, 1.01, 1.01,1],
    ["1 долар США", "111","2003", 334.00, 396.00, 1.19, 652.62, 1.65, 1.95,1], 
    ["1 долар США", "111","2004", 700.30, 725.15, 1.04, 750.10, 1.03, 1.07,1],
    ["1 долар США", "111","2005", 765.15, 775.10, 1.01, 785.20, 1.01, 1.03,1],
    ] 
boba = ["Найменування валюти","Код валюти","Рік","1.10","курс крб. 1.11","рівень 1.11","курс крб. 1.12","рівень 1.12","Рівень за три місяці","1"]



#Графік
valuta103 = [5.64, 6.05, 10.03, 1.10, 11.21, 13.50, 13.64, 13.70, 13.80]
valuta104 = [1.13, 1.23, 2.00, 2.50, 2.60, 2.75, 2.80, 2.83, 2.85]
valuta105 = [2.28, 2.52, 4.12, 4.44, 4.65, 4.70, 4.75, 4.80, 4.85]
valuta106 = [2.02, 2.24, 3.66, 4.05, 4.25, 4.50, 4.62, 4.64, 4.66]
valuta109 = [2.68, 3.18, 5.12, 6.05, 6.30, 6.80, 6.90, 6.95, 7.00]
valuta111 = [3.34, 3.96, 6.53, 7.00, 7.25, 7.50, 7.65, 7.75, 7.85]
year = ["1.10.2003","1.11.2003","1.12.2003","1.10.2004","1.11.2004","1.12.2004","1.10.2005","1.11.2005","1.12.2005"] 

fig=plt.figure(figsize=(20,10))
plt.plot(year,valuta103,label = "Код 103")
plt.plot(year,valuta104,label = "Код 104")
plt.plot(year,valuta105,label = "Код 105")
plt.plot(year,valuta106,label = "Код 106")
plt.plot(year,valuta109,label = "Код 109")
plt.plot(year,valuta111,label = "Код 111")
plt.xlabel("Дата")
plt.ylabel("Ціна")
plt.legend()
plt.grid(True)
plt.savefig('Graphic.png')

def graphic():
    plt.show()



#Таблиця
x = PrettyTable()
x.field_names = ["Найменування валюти","Код валюти","Рік","1.10","крб. 1.11","рівень 1.11","крб. 1.12","рівень 1.12","Рівень за три місяці","1"]

for i in range(0, len(biba)):
    x.add_rows(
        [
            biba[i]
        ]
    )

def Tablitsa():
    print('\nАналіз зміни курсу гривні до валют іноземних країн')
    print(x)



#Збереження в Exel
with open("Tablitsa.csv", 'w', newline='') as csvfile:
    writer = csv.writer(csvfile, delimiter=";")
    writer.writerow(["Найменування валюти","Код валюти","Рік","1.10","курс крб. 1.11","рівень 1.11","курс крб. 1.12","рівень 1.12","Рівень за три місяці","1"])
    writer.writerow(["1 англійський фунт стерлінг", "103","2003", 565.46, 604.57, 1.07, 1003.17, 1.66, 1.77,1])
    writer.writerow(["1 англійський фунт стерлінг", "103","2004", 110.25, 1120.60, 10.16, 1350.40, 1.21, 12.25,1])
    writer.writerow(["1 англійський фунт стерлінг", "103","2005", 1364.20, 1370.10, 1.00, 1380.15, 1.01, 1.01,1])
    writer.writerow(["10 бельгійських франків", "104","2003", 113.03, 122.60, 1.08, 200.38, 1.63, 1.77,1])
    writer.writerow(["10 бельгійських франків", "104","2004", 250.45, 260.45, 1.04, 275.20, 1.06, 1.10,1])
    writer.writerow(["10 бельгійських франків", "104","2005", 280.10, 283.40, 1.01, 285.10, 1.01, 1.02,1])
    writer.writerow(["1 німецька марка", "105","2003", 227.91, 252.07, 1.11, 412.02, 1.63, 1.81,1])
    writer.writerow(["1 німецька марка", "105","2004", 444.23, 465.40, 1.05, 470.20, 1.01, 1.06,1])
    writer.writerow(["1 німецька марка", "105","2005", 475.23, 480.30, 1.01, 485.20, 1.01, 1.02,1])
    writer.writerow(["1 голандський гульден", "106","2003", 202.42, 224.00, 1.11, 366.26, 1.64, 1.81,1])
    writer.writerow(["1 голандський гульден", "106","2004", 405.05, 425.35, 1.05, 450.30, 1.06, 1.11,1])
    writer.writerow(["1 голандський гульден", "106","2004", 462.20, 464.10, 1.00, 466.15, 1.00, 1.01,1])
    writer.writerow(["1 канадський долар", "109","2003", 267.88, 318.00, 1.19, 511.92, 1.61, 1.91,1]) 
    writer.writerow(["1 канадський долар", "109","2004", 605.20, 630.15, 1.04, 680.25, 1.08, 1.12,1])
    writer.writerow(["1 канадський долар", "109","2005", 690.10, 695.15, 1.01, 699.80, 1.01, 1.01,1])
    writer.writerow(["1 долар США", "111","2003", 334.00, 396.00, 1.19, 652.62, 1.65, 1.95,1]) 
    writer.writerow(["1 долар США", "111","2004", 700.30, 725.15, 1.04, 750.10, 1.03, 1.07,1])
    writer.writerow(["1 долар США", "111","2005", 765.15, 775.10, 1.01, 785.20, 1.01, 1.03,1])
def save_Exel():
    ("Tablitsa.csv")



#Збереження в .txt
columns = len(boba)
table = PrettyTable(boba)

dt_data = biba[:]
while dt_data:
    columns = 5
    table.add_rows(dt_data[:columns])
    dt_data = dt_data[columns:]
table1 = str(table) 
f = open('Tablitsa.txt', 'w', encoding='utf-8')
f.write(table1 )
f.close()

def save_txt():
    ("Tablitsa.txt")

